<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class ProductSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $products = [
            [
                'name' => 'کتاب اثر مرکب نوشته دارن هاردی',
                'slug' => 'کتاب-اثر-مرکب-نوشته-دارن-هاردی',
                'introduction' => 'خلاصه کتاب اثر مرکب «انتخاب‌های شما تنها زمانی معنی دار است که آنها را به دلخواه به رؤیاهای خود متصل کنید. انتخاب‌های شایسته و انگیزشی، همان‌هایی هستند که شما به عنوان هدف خود و هسته اصلی زندگی خود در بالاترین ارزش‌های خود تعین می‌کنید',
                'image' => 'products/1.jpg',
                'price' => '5000',
            ],
            [
                'name' => 'مجموعه داستان های قصه های مشهور جهان',
                'slug' => 'مجموعه-داستان-های-قصه-های-مشهور-جهان',
                'introduction' => 'شما باید چیزی را بخواهید و می‌دانید که چرا شما آن را می‌خواهید یا به راحتی می‌توانید آن از دست بدهید.» «اولین گام در جهت تغییر، آگاهی است. اگر می‌خواهید از جایی که هستید به جایی که می‌خواهید بروید، باید با درک انتخاب‌هایی که شما را از مقصد مورد نظر خود دور می‌کنند، شروع کنید.»',
                'image' => 'products/7.jpg',
                'price' => '5000',
            ],
            [
                'name' => 'کتاب شیوه گرگ اثر جردن بلفورت',
                'slug' => 'کتاب-شیوه-گرگ-اثر-جردن-بلفورت',
                'introduction' => '«فرمول کامل برای به دست آوردن خوش شانسی: آماده‌سازی (رشد شخصی) + نگرش (باور / ذهنیت) + فرصت (چیز خوبی که راه را هموار می‌کند) + اقدام (انجام کاری در مورد نظر) = شانس» «ما همه می‌توانیم انتخاب‌های بسیار خوبی داشته باشیم. ما می‌توانیم همه چیز را کنترل کنیم. این در توانایی ماست که همه چیز را تغییر دهیم. به جای اینکه غرق در گذشته شویم، باید دوباره انرژی خود را جمع کنیم، می‌توانیم از تجربیات گذشته برای حرکت‌های مثبت و سازنده استفاده کنیم.» ',
                'image' => 'products/6.jpg',
                'price' => '5000',
            ],
        ];
        DB::table('products')->upsert($products, ['name', 'slug']);
    }
}
